http/results/retro-lwt-classic-libev-R20000.txt
Running 20s test @ http://127.0.0.1:18960/
  4 threads and 100 connections
  Thread calibration: mean lat.: 2.595ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 2.825ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 2.963ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 3.074ms, rate sampling interval: 14ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.96ms    3.59ms  25.31ms   89.18%
    Req/Sec     5.20k     1.11k   10.83k    83.15%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.79ms
 75.000%    2.58ms
 90.000%    7.18ms
 99.000%   18.64ms
 99.900%   22.67ms
 99.990%   24.48ms
 99.999%   25.26ms
100.000%   25.33ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.076     0.000000            1         1.00
       0.829     0.100000        19766         1.11
       1.094     0.200000        39525         1.25
       1.342     0.300000        59304         1.43
       1.563     0.400000        78994         1.67
       1.789     0.500000        98778         2.00
       1.905     0.550000       108616         2.22
       2.032     0.600000       118466         2.50
       2.175     0.650000       128439         2.86
       2.347     0.700000       138224         3.33
       2.581     0.750000       148080         4.00
       2.745     0.775000       153048         4.44
       2.969     0.800000       157957         5.00
       3.311     0.825000       162891         5.71
       3.969     0.850000       167814         6.67
       5.355     0.875000       172752         8.00
       6.239     0.887500       175222         8.89
       7.175     0.900000       177684        10.00
       8.231     0.912500       180153        11.43
       9.415     0.925000       182639        13.33
      10.599     0.937500       185097        16.00
      11.207     0.943750       186330        17.78
      11.847     0.950000       187556        20.00
      12.527     0.956250       188790        22.86
      13.175     0.962500       190029        26.67
      13.783     0.968750       191267        32.00
      14.111     0.971875       191879        35.56
      14.487     0.975000       192495        40.00
      15.039     0.978125       193119        45.71
      15.711     0.981250       193729        53.33
      16.687     0.984375       194351        64.00
      17.135     0.985938       194654        71.11
      17.743     0.987500       194963        80.00
      18.223     0.989062       195272        91.43
      18.895     0.990625       195581       106.67
      19.423     0.992188       195888       128.00
      19.887     0.992969       196041       142.22
      20.431     0.993750       196194       160.00
      20.767     0.994531       196347       182.86
      21.103     0.995313       196505       213.33
      21.359     0.996094       196657       256.00
      21.487     0.996484       196733       284.44
      21.631     0.996875       196812       320.00
      21.839     0.997266       196893       365.71
      21.999     0.997656       196965       426.67
      22.159     0.998047       197044       512.00
      22.239     0.998242       197082       568.89
      22.351     0.998437       197121       640.00
      22.463     0.998633       197162       731.43
      22.559     0.998828       197196       853.33
      22.687     0.999023       197241      1024.00
      22.735     0.999121       197258      1137.78
      22.815     0.999219       197274      1280.00
      22.911     0.999316       197294      1462.86
      23.023     0.999414       197312      1706.67
      23.247     0.999512       197330      2048.00
      23.375     0.999561       197340      2275.56
      23.519     0.999609       197351      2560.00
      23.599     0.999658       197360      2925.71
      23.695     0.999707       197369      3413.33
      23.951     0.999756       197378      4096.00
      24.015     0.999780       197384      4551.11
      24.143     0.999805       197388      5120.00
      24.255     0.999829       197393      5851.43
      24.367     0.999854       197398      6826.67
      24.415     0.999878       197402      8192.00
      24.447     0.999890       197405      9102.22
      24.495     0.999902       197407     10240.00
      24.559     0.999915       197410     11702.86
      24.831     0.999927       197413     13653.33
      24.863     0.999939       197414     16384.00
      24.927     0.999945       197416     18204.44
      25.023     0.999951       197417     20480.00
      25.039     0.999957       197418     23405.71
      25.055     0.999963       197419     27306.67
      25.199     0.999969       197420     32768.00
      25.215     0.999973       197421     36408.89
      25.231     0.999976       197422     40960.00
      25.231     0.999979       197422     46811.43
      25.247     0.999982       197423     54613.33
      25.247     0.999985       197423     65536.00
      25.263     0.999986       197424     72817.78
      25.263     0.999988       197424     81920.00
      25.263     0.999989       197424     93622.86
      25.279     0.999991       197425    109226.67
      25.279     0.999992       197425    131072.00
      25.279     0.999993       197425    145635.56
      25.279     0.999994       197425    163840.00
      25.279     0.999995       197425    187245.71
      25.327     0.999995       197426    218453.33
      25.327     1.000000       197426          inf
#[Mean    =        2.957, StdDeviation   =        3.591]
#[Max     =       25.312, Total count    =       197426]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  394043 requests in 20.00s, 795.92MB read
Requests/sec:  19702.75
Transfer/sec:     39.80MB

JSON Output:
{
	"requests": 394043,
	"duration_in_microseconds": 19999394.00,
	"bytes": 834583074,
	"requests_per_sec": 19702.75,
	"bytes_transfer_per_sec": 41730418.13,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 1789
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 2581
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 7175
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 18639
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 22671
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 24479
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 25263
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 25327
		}
	]
}