http/results/retro-lwt-classic-libev-R5000.txt
Running 20s test @ http://127.0.0.1:18960/
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.614ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.499ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.671ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.697ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.07ms    1.09ms   8.42ms   68.40%
    Req/Sec     1.32k   614.01     2.78k    74.13%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.87ms
 75.000%    2.71ms
 90.000%    3.61ms
 99.000%    5.16ms
 99.900%    6.47ms
 99.990%    8.06ms
 99.999%    8.43ms
100.000%    8.43ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.118     0.000000            1         1.00
       0.837     0.100000         4935         1.11
       1.115     0.200000         9875         1.25
       1.365     0.300000        14811         1.43
       1.614     0.400000        19737         1.67
       1.865     0.500000        24684         2.00
       1.996     0.550000        27149         2.22
       2.139     0.600000        29612         2.50
       2.299     0.650000        32088         2.86
       2.491     0.700000        34550         3.33
       2.711     0.750000        37007         4.00
       2.839     0.775000        38246         4.44
       2.973     0.800000        39488         5.00
       3.111     0.825000        40716         5.71
       3.255     0.850000        41957         6.67
       3.413     0.875000        43178         8.00
       3.503     0.887500        43803         8.89
       3.607     0.900000        44416        10.00
       3.711     0.912500        45028        11.43
       3.829     0.925000        45649        13.33
       3.977     0.937500        46259        16.00
       4.057     0.943750        46577        17.78
       4.139     0.950000        46879        20.00
       4.231     0.956250        47186        22.86
       4.335     0.962500        47502        26.67
       4.467     0.968750        47807        32.00
       4.539     0.971875        47960        35.56
       4.619     0.975000        48112        40.00
       4.707     0.978125        48267        45.71
       4.795     0.981250        48422        53.33
       4.915     0.984375        48572        64.00
       4.975     0.985938        48649        71.11
       5.043     0.987500        48727        80.00
       5.111     0.989062        48807        91.43
       5.187     0.990625        48883       106.67
       5.287     0.992188        48961       128.00
       5.347     0.992969        48998       142.22
       5.411     0.993750        49035       160.00
       5.475     0.994531        49074       182.86
       5.579     0.995313        49114       213.33
       5.703     0.996094        49151       256.00
       5.771     0.996484        49171       284.44
       5.831     0.996875        49188       320.00
       5.919     0.997266        49208       365.71
       6.023     0.997656        49227       426.67
       6.095     0.998047        49246       512.00
       6.155     0.998242        49256       568.89
       6.215     0.998437        49265       640.00
       6.287     0.998633        49275       731.43
       6.351     0.998828        49285       853.33
       6.475     0.999023        49294      1024.00
       6.515     0.999121        49299      1137.78
       6.567     0.999219        49304      1280.00
       6.651     0.999316        49310      1462.86
       6.707     0.999414        49314      1706.67
       6.859     0.999512        49318      2048.00
       7.119     0.999561        49321      2275.56
       7.219     0.999609        49323      2560.00
       7.599     0.999658        49326      2925.71
       7.667     0.999707        49328      3413.33
       7.775     0.999756        49330      4096.00
       7.895     0.999780        49332      4551.11
       7.899     0.999805        49333      5120.00
       7.919     0.999829        49334      5851.43
       7.939     0.999854        49336      6826.67
       7.939     0.999878        49336      8192.00
       8.063     0.999890        49337      9102.22
       8.111     0.999902        49338     10240.00
       8.111     0.999915        49338     11702.86
       8.335     0.999927        49339     13653.33
       8.335     0.999939        49339     16384.00
       8.351     0.999945        49340     18204.44
       8.351     0.999951        49340     20480.00
       8.351     0.999957        49340     23405.71
       8.383     0.999963        49341     27306.67
       8.383     0.999969        49341     32768.00
       8.383     0.999973        49341     36408.89
       8.383     0.999976        49341     40960.00
       8.383     0.999979        49341     46811.43
       8.431     0.999982        49342     54613.33
       8.431     1.000000        49342          inf
#[Mean    =        2.068, StdDeviation   =        1.089]
#[Max     =        8.424, Total count    =        49342]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  98555 requests in 20.00s, 199.07MB read
Requests/sec:   4927.62
Transfer/sec:      9.95MB

JSON Output:
{
	"requests": 98555,
	"duration_in_microseconds": 20000539.00,
	"bytes": 208739490,
	"requests_per_sec": 4927.62,
	"bytes_transfer_per_sec": 10436693.23,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 1865
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 2711
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 3607
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 5155
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 6471
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 8063
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 8431
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 8431
		}
	]
}